# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 1
b = 1.3
c = 'text'
d = {}
e = []
f = True
print(f'Переменная {a} принадлежаит к типу {type(a)}')
print(f'Переменная {b} принадлежаит к типу {type(b)}')
print(f'Переменная {c} принадлежаит к типу {type(c)}')
print(f'Переменная {d} принадлежаит к типу {type(d)}')
print(f'Переменная {e} принадлежаит к типу {type(e)}')
print(f'Переменная {f} принадлежаит к типу {type(f)}')
